{
  "img1": "https://studywizards.com/wp-content/themes/studywizards-wordpress/library/images/blogs/AP-Blog.jpg",
  "img2": "https://studywizards.com/wp-content/themes/studywizards-wordpress/library/images/blogs/ADHD-Blog.jpg",
  "img3": "https://studywizards.com/wp-content/uploads/2019/11/FamilyDinnerSmallest.jpg",
  "tag": "Blog",
  "mainHeading": "The Best Ways to Prep for the SAT and ACT",
  "mainSubheading": "Posted August 10, 2020",
  "heading1": "Intro",
  "heading2": "Know the Test Structure",
  "heading3": "Understanding the Scoring",
  "heading4": "Take a Practice Test, Set a Goal",
  "heading5": "Practice Time Management",
  "leftHeading1": "Read Our Blog",
  "leftHeading2": "More Blog Posts",
  "leftHeading3": "Our Articles",
  "leftSubheading1": "AP Exams",
  "leftSubheading2": "Help your Child with ADHD",
  "leftSubheading3": "Family Dinners",
  "btnHeadingLeft": "What Others Say About Us",
  "btnHeadingRight": "What Our Tutors Say About Us",
  "btnP1": "Read our most recent success stories from other parents in your area",
  "btnP2": "Read about why our tutors love about working for Study Wizards",
  "btnLink1": "/reviews",
  "btnLink2": "/tutor-reviews",
  "isLink": true,
  "isBlog": true,
  "p1": "The SAT and ACT are the two tests on every college-bound teenager’s mind as soon as they enter their junior year. While college applications don’t boil down to a single test score, having a good score on these tests is still very important in the college admissions process. Whether taking one test or both, it’s crucial to have a study plan for the months prior to the actual test. Here are the top things to think about while preparing for these notorious standardized tests.",
  "p2": "Both tests contain different sections and testing times, and it’s crucial to be familiar with these formats before taking the test. The most recent version of the SAT has two main sections: Evidence Based Reading & Writing(EBRW) and Mathematics.There is also an optional essay section.The EBRW section involves two subsections.The reading subsection lasts 65 minutes and consists of 52 multiple - choice questions, and the writing subsection lasts 35 minutes and consists of 44 multiple - choice questions.These questions test comprehension, vocabulary, the expression of ideas, and argument formation.Likewise, the Mathematics section is broken down into two parts.A 25 - minute “no calculator” section and a 55 - minute “calculator allowed” section.They consist of 20 and 38 questions, respectively. The ACT is different.It’s comprised of four multiple - choice sections—English(75 questions, 45 minutes), Math(60 questions, 60 minutes), Reading(40 questions, 35 minutes), and Science(40 questions, 35 minutes) —and an optional 40 - minute essay.The Math, English, and Reading sections are similar to the SAT, but the Science section focuses on data analysis and interpretation.This section is a boon for some students but a blow to others.",
  "p3": "Probably unlike many of your child’s tests in school, the SAT and ACT don’t penalize for wrong or skipped answers. Only correct answers add up to their composite score. This means that if a question is especially hard, it’s best to skip it, come back to it later and if need be make one’s best guess. Getting as many questions right as possible should be the main goal for SAT and ACT testers. The SAT is scored out of 1600, with the optional essay scored on a scale from 2 to 8. The maximum score on the ACT is a 36, with the essay scored on a 2 to 12 scale.The average SAT score sits around a 1060, with the ACT national average at about 21.",
  "p4": "There are thousands of practice tests in study books and online. Many high schools even proctor PSATs sometime during sophomore or junior year. It’s a great idea to have your student take at least one practice test to predict their base score and see what areas need the most improvement. For instance, your teen might score a 1250 on a practice SAT and have a significantly higher Math score, while they may also have a high Math score on the ACT, but score closer to 21, the national average.This signals two things.One, that they should be reviewing their English and Reading skills, and two, that they’re likely to score higher on the SAT than the ACT.After this, it’s possible to set a study plan and shoot for a concrete score—a 1400, say.",
  "p5": "Since the SAT and ACT don’t penalize for wrong answers, answering as many questions as possible is a key success factor. Answering more than one question per minute is a challenge, but with repetition and practice, it’s something test takers can get better at over time. Using process of elimination, educated guesses, and being willing to skip over hard questions and return to them later will keep SAT and ACT students from leaving too many questions unanswered."
}
